Revit 2026 API

# ExternalResourceReferenceFailures Properties

---

The BuiltInFailuresExternalResourceReferenceFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReferenceToLocalFile | The External Resource refers to a local file that may not be available to workshared users. |

#### Reference

BuiltInFailuresExternalResourceReferenceFailures Class

Autodesk.Revit.DB Namespace